
// ----------------------------------- Task 2 -------------------------------------------

alert ('Напишите цикл с шагом 1, в теле которого распечатываются квадраты каждого четного значения счетчика.');

for (let i = 1; i <= 100; i++){
    if (i % 2 === 0) {
        console.log(i * i);
    }
}

// ----------------------------------- Task 3 -------------------------------------------

alert ('Сформируйте строку вида ".#.#.#.#.#." чередованием символов . и # в каждой итерации с помощью цикла for. После выхода из цикла распечатайте полученную строку.');
let string = '';
for (let i = 1; i <= 20; i++) {
    string += (i % 2 === 0) ? '#' : '.'; 
}

alert(string);

// ----------------------------------- Task 4 -------------------------------------------
alert('Напишите цикл с confirm, который продолжается при нажатии на Отмена и прерывается при нажатии на Ok.');

let task4 ;
do{
    task4 = confirm('Click OK or Cancel');
} while (task4 === false);

// ----------------------------------- Task 5 -------------------------------------------
alert('Напишите бесконечный цикл, который прерывается при помощи команды break, когда Math.random() > 0.99. Выведите в окно alert случайное число, прервавшее цикл, и количество итераций цикла.');
for (let i = 1; ; i++) {
    const task5 = Math.random();
    if (task5 > 0.99) {
        alert(`число, прервавшее цикл = ${task5}; количество итераций цикла = ${i}`);
        break;
    }
}

// ----------------------------------- Task 6 -------------------------------------------
alert('Используя вложенные циклы, сформируйте строку чередованием символов . и # таким образом, чтобы получилась шахматный узор.');
let rows = 8,
    colums = 8,
    chessBoard = '';
for ( i = 1; i <= rows; i++) {
    const isEven = i % 2 === 0;
    let strRow = '';
    for ( j = 1; j <= colums; j++) {
        if (isEven) {
            strRow += (j % 2 === 0) ? '#' : '.';
        } else {
            strRow += (j % 2 === 0) ? '.' : '#';
        }
    }
    chessBoard += `${strRow}\n`;
} 
alert( chessBoard);

// ----------------------------------- Task 7 -------------------------------------------
alert('С помощью цикла for с пустым телом сформируйте строку, представляющую из себя ряд Фибоначчи: 0 1 1 2 3 5 8 13...');

var limit = 50,
    a , b , c, strF = '';
    for ( a = 0, b = 1; c = a + b, c < limit; a = b, b = c)
    strF += c + ' ';
    alert (strF);

// ----------------------------------- Task 8 -------------------------------------------
alert('Запустите цикл, в котором пользователю предлагается вводить число с клавиатуры, до тех пор, пока не будет нажата Отмена. После выхода из цикла распечатайте количество введенных чисел, их общую сумму и среднее арифметическое.');


let abs, amount = -1, sum = 0, average = 0;
 
do{
    abs = +prompt('Enter number', 5);
    sum += abs; 
    amount++;
    average = sum / amount;
} while (abs);
alert(`колличество вводов - ${amount}, сумма всех чисел - ${sum}, среднее арифметическое - ${average}`);




// ----------------------------------- Task 9 -------------------------------------------
 alert('Найдите и исправьте ошибки в коде');

for (let i = 0; i < 10; i++) {
	for (let j = 0; j < 10; j++) {
		console.log(i + j);
	}
}

// ----------------------------------- Task 10 -------------------------------------------
Поиск элементов DOM (объектной структуры документа) с использованием
нативных методов JS

$(document).ready(function(){
    $("table").css({"margin":"0 auto", "border-collapse": "collapse", });

    $("table td").css({
        "width": "10px",
        "height": "10px",
        "background-color": "#eee", 
        "box-sizing": "border-box",
        "border": "1px solid #000"
    });

    $(" #root tr:nth-child(-n+6) td").css({"background-color":"#106B63"});
    $("#root tr:nth-child(n+7):nth-child(-n+9) td").css({"background-color":"#E7C610"});
    $("#root tr:nth-child(n+10):nth-child(-n+12) td").css({"background-color":"#C64A08"});
    $("#root tr:nth-child(n+13):nth-child(-n+15) td").css({"background-color":"#B43100"});
    $(" tr:nth-child(n+15) td").css({"background-color":"#102173"});
    $(".none").css({"background-color":"transparent", "border":"none"});
});
// ----------------------------------- Task 11 -------------------------------------------
// alert('Сформируйте строку в виде треугольника-елочки:');

